MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC505YLA/mcu.h
#define WWDT_CTL_WWDTEN_Pos              (0)                                               /*!< WWDT_T::CTL: WWDTEN Position              */
#define WWDT_CTL_WWDTEN_Msk              (0x1ul << WWDT_CTL_WWDTEN_Pos)                    /*!< WWDT_T::CTL: WWDTEN Mask                  */

#define WWDT_CTL_INTEN_Pos               (1)                                               /*!< WWDT_T::CTL: INTEN Position               */
#define WWDT_CTL_INTEN_Msk               (0x1ul << WWDT_CTL_INTEN_Pos)                     /*!< WWDT_T::CTL: INTEN Mask                   */

#define WWDT_CTL_PSCSEL_Pos              (8)                                               /*!< WWDT_T::CTL: PSCSEL Position              */
#define WWDT_CTL_PSCSEL_Msk              (0xful << WWDT_CTL_PSCSEL_Pos)                    /*!< WWDT_T::CTL: PSCSEL Mask                  */

#define WWDT_CTL_CMPDAT_Pos              (16)                                              /*!< WWDT_T::CTL: CMPDAT Position              */
#define WWDT_CTL_CMPDAT_Msk              (0x3ful << WWDT_CTL_CMPDAT_Pos)                   /*!< WWDT_T::CTL: CMPDAT Mask                  */

#define WWDT_CTL_ICEDEBUG_Pos            (31)                                              /*!< WWDT_T::CTL: ICEDEBUG Position            */
#define WWDT_CTL_ICEDEBUG_Msk            (0x1ul << WWDT_CTL_ICEDEBUG_Pos)                  /*!< WWDT_T::CTL: ICEDEBUG Mask                */

#define WWDT_STATUS_WWDTIF_Pos           (0)                                               /*!< WWDT_T::STATUS: WWDTIF Position           */
#define WWDT_STATUS_WWDTIF_Msk           (0x1ul << WWDT_STATUS_WWDTIF_Pos)                 /*!< WWDT_T::STATUS: WWDTIF Mask               */

#define WWDT_STATUS_WWDTRFC_Pos          (1)                                               /*!< WWDT_T::STATUS: WWDTRFC Position          */
#define WWDT_STATUS_WWDTRFC_Msk          (0x1ul << WWDT_STATUS_WWDTRFC_Pos)                /*!< WWDT_T::STATUS: WWDTRFC Mask              */

#define WWDT_CNT_CNTDAT_Pos              (0)                                               /*!< WWDT_T::CNT: CNTDAT Position              */
#define WWDT_CNT_CNTDAT_Msk              (0x3ful << WWDT_CNT_CNTDAT_Pos)                   /*!< WWDT_T::CNT: CNTDAT Mask                  */

#define WWDT_RSTSTS_WWDTRF_Pos           (1)                                               /*!< WWDT_T::RSTSTS: WWDTRF Position           */
#define WWDT_RSTSTS_WWDTRF_Msk           (0x1ul << WWDT_RSTSTS_WWDTRF_Pos)                 /*!< WWDT_T::RSTSTS: WWDTRF Mask               */

/**@}*/ /* WWDT_CONST */
/**@}*/ /* end of WWDT register group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

/*@}*/ /* end of group NUC505_Peripherals */

/** @addtogroup NUC505_PERIPHERAL_MEM_MAP NUC505 Peripheral Memory Map
  Memory Mapped Structure for NUC505 Series Peripheral
  @{
 */
/* Peripheral and SRAM base address */
#define SRAM_BASE            ((uint32_t)0x20000000)      /*!< SRAM Base Address       */
#define PERIPH_BASE          ((uint32_t)0x40000000)      /*!< Peripheral Base Address */
#define AHBPERIPH_BASE       PERIPH_BASE                 /*!< AHB Base Address */
#define APBPERIPH_BASE       (PERIPH_BASE + 0x000E0000)  /*!< APB Base Address */

/*!< AHB peripherals */
#define SYS_BASE             (AHBPERIPH_BASE + 0x00000)
#define CLK_BASE             (AHBPERIPH_BASE + 0x00200)
#define SPIM_BASE            (AHBPERIPH_BASE + 0x07000)
#define UDC_BASE             (AHBPERIPH_BASE + 0x09000)
#define SDH_BASE             (AHBPERIPH_BASE + 0x0A000)
#define USBH_BASE            (AHBPERIPH_BASE + 0x0B000)

/*!< APB peripherals */
#define SPI1_BASE            (APBPERIPH_BASE + 0x1000)
#define ADC_BASE             (APBPERIPH_BASE + 0x2000)
#define GPIOA_BASE           (APBPERIPH_BASE + 0x3000)
#define GPIOB_BASE           (APBPERIPH_BASE + 0x3010)
#define GPIOC_BASE           (APBPERIPH_BASE + 0x3020)
#define GPIOD_BASE           (APBPERIPH_BASE + 0x3030)
#define GPIO_BASE            (APBPERIPH_BASE + 0x3070)
#define I2C0_BASE            (APBPERIPH_BASE + 0x4000)
#define I2C1_BASE            (APBPERIPH_BASE + 0x5000)
#define PWM_BASE             (APBPERIPH_BASE + 0x6000)
#define RTC_BASE             (APBPERIPH_BASE + 0x7000)
#define I2S_BASE             (APBPERIPH_BASE + 0x8000)
#define SPI0_BASE            (APBPERIPH_BASE + 0x9000)
#define TIMER0_BASE          (APBPERIPH_BASE + 0xA000)
#define TIMER1_BASE          (APBPERIPH_BASE + 0xA020)
#define TIMER2_BASE          (APBPERIPH_BASE + 0xB000)
#define TIMER3_BASE          (APBPERIPH_BASE + 0xB020)
#define UART0_BASE           (APBPERIPH_BASE + 0xC000)
#define UART1_BASE           (APBPERIPH_BASE + 0xD000)
#define UART2_BASE           (APBPERIPH_BASE + 0xE000)
#define WDT_BASE             (APBPERIPH_BASE + 0xF000)
#define WWDT_BASE            (APBPERIPH_BASE + 0xF100)


/*@}*/ /* end of group NUC505_PERIPHERAL_MEM_MAP */


/** @addtogroup NUC505_PERIPHERAL_DECLARATION NUC505 Peripheral Pointer
  The Declaration of NUC505 Series Peripheral
  @{
 */

#define SYS                  ((SYS_T *)   SYS_BASE)
#define CLK                  ((CLK_T *)   CLK_BASE)
#define SPIM                 ((SPIM_T *)  SPIM_BASE)
#define APU                  ((APU_T *)   APU_BASE)
#define USBD                 ((USBD_T *)  UDC_BASE)
#define SD                   ((SDH_T *)   SDH_BASE)
#define USBH                 ((USBH_T *)  USBH_BASE)

#define SPI1                 ((SPI_T *)   SPI1_BASE)
#define ADC                  ((ADC_T *)   ADC_BASE)
#define PA                   ((GPIO_PA_T *)  GPIOA_BASE)
#define PB                   ((GPIO_PB_T *)  GPIOB_BASE)
#define PC                   ((GPIO_PC_T *)  GPIOC_BASE)
#define PD                   ((GPIO_PD_T *)  GPIOD_BASE)
#define GPIO                 ((GPIO_T *)  GPIO_BASE)
#define I2C0                 ((I2C_T *)   I2C0_BASE)
#define I2C1                 ((I2C_T *)   I2C1_BASE)
#define PWM                  ((PWM_T *)   PWM_BASE)
#define RTC                  ((RTC_T *)   RTC_BASE)
#define SPI0                 ((SPI_T *)   SPI0_BASE)
#define I2S                  ((I2S_T *)   I2S_BASE)
#define TIMER0               ((TIMER_T *) TIMER0_BASE)
#define TIMER1               ((TIMER_T *) TIMER1_BASE)
#define TIMER2               ((TIMER_T *) TIMER2_BASE)
#define TIMER3               ((TIMER_T *) TIMER3_BASE)
#define UART0                ((UART_T *)  UART0_BASE)
#define UART1                ((UART_T *)  UART1_BASE)
#define UART2                ((UART_T *)  UART2_BASE)
#define WDT                  ((WDT_T *)   WDT_BASE)
#define WWDT                 ((WWDT_T *)  WWDT_BASE)
/*@}*/ /* end of group NUC505_PERIPHERAL_DECLARATION */


